{"posts":[{"title":"Vol.001 Yearly Goals for 2024","text":"About My 2023 Annual Review and 2024 Goals Planning This article is also available in 繁體中文 A new year, and a quarter of my life has passed. Looking back at the last year, even years, my life can be described as aimless and unproductive. Of course, what’s past is past, and I hope this year will bring some change.In the last two or three years, I have also tried to challenge myself in some ways. I have set some goals for this year too. Maybe, like before, these goals might not be achieved, but I still want to try! I will update my status every month, hoping we can grow together! About Health Maintain Exercise Habits Indicator 1: Jog 5 kilometers at least five days a week. Indicator 2: Train at least one body part at least five days a week. Indicator 3: Keep body fat percentage below 15%. Regular Fasting Indicator 1: Perform 16/8 intermittent fasting at least six days a week, with no more than four exceptions per year due to special circumstances. Indicator 2: Undertake two 100-hour fasts each year. Good Sleep Habits Indicator 1: Wake up at 05:00 every day. Indicator 2: Achieve 35 sleep cycles per week, with at least 4 cycles each day. Other Indicator 1: Take a cold shower after exercise. Indicator 2: Focus on a plant-based diet as much as possible. About Learning Professional Knowledge: Self-study MIT EECS Online Courses Indicator 1: Complete the courses required for an MIT EECS degree, including assignments, quizzes, finals, and projects. Indicator 2: Finish at least one course per month. Indicator 3: Gain admission to a graduate program in computer science. Review High School Knowledge Indicator 1: Complete high school mathematics, physics, chemistry, biology. Reading Habit Indicator 1: Read at least four books per month. Indicator 2: Write a review for each book and summarize the same domain after reading more than four books, then write a blog article. Language Indicator 1: Japanese JLPT N2. Indicator 2: English TOEIC 860. About Life Climb Ten of Taiwan’s Hundred Peaks Indicator 1: Climb ten of Taiwan’s Hundred Peaks. Learn Photography Indicator 1: Shoot ten YouTube videos. Indicator 2: Post 50 photos on Instagram. Build Personal Brand Indicator 1: Reach 10,000 monthly visitors on a single platform. Skill Learning Indicator 1: Obtain the AIDA-2 or PADI-AOW freediving certification. Indicator 2: Obtain the ISA Surfing Instructor Course certification.","link":"/Vol.001/"}],"tags":[{"name":"Yearly Goals","slug":"Yearly-Goals","link":"/tags/Yearly-Goals/"}],"categories":[{"name":"Self-Growth and Development","slug":"Self-Growth-and-Development","link":"/categories/Self-Growth-and-Development/"}],"pages":[{"title":"Yang Chen","text":"This article is also available in 繁體中文 About Me Recommend Books 2024.01.30 Initial IntentionsWandering, this is the word that best fits my current state.Once upon a time, I had great ambitions and rich ideals, but now they have been devoured by my laziness. I love adventure, nature, technology, and reading books while listening to music alone. However, in the eyes of society, I am seen as uneducated and idle. I don’t want to follow the crowd, but I also don’t want to disappoint those who believe in me. So, I have to try again, no matter the outcome. | Self-Growth | Challenge | Exploring the Unknown | Let’s growth together!!! Email: E-mailYoutube: Yang’s ChannelInstagram: yangexplores HealthLifespan: Why We Age―and Why We Don’t Have To Investment and Finance","link":"/about/index.html"}]}